<template>
  <div>
    <div id="myChart"></div>
  </div>
</template>

<script>

export default {
  name: '',
  data() {
    return {
      list: [
        {
          'count': 17,
          'keywords': '物资/出口/防疫/医疗/国家/中国/企业/全球/疫情/提供',
          'keysentences': '在今天（4月30日）商务部举行的例行发布会上，新闻发言人高峰表示：中国政府一贯高度重视防疫物资出口质量，下一步将继续严把出口质量关，鼓励合格企业扩大防疫物资出口，有效支持国际社会抗击疫情/中方为包括印度在内的国家进口医疗物资打开方便之门，在保证国内防疫需求的前提下，支持有资质、有信誉的企业对外出口，并在生产、运输、清关等各个环节为各国来华采购和企业有序出口提供便利/高峰强调，中国没有限制防疫物资出口，而是想方设法为世界各国采购提供便利和支持'
        }, {
          'count': 17,
          'keywords': '收费/通行费/调整/预估/高速公路/费用/系统/计费/收费站/金额',
          'keysentences': '为了便于驾驶员更清楚地了解高速公路通行费计费情况，今日（4月30日），交通运输部路网监测与应急指挥中心与相关企业合作，共同推出国内首个高速收费计算器——“ETC对账助手”/为了更好地服务车主，4月30日，交通运输部路网监测与应急指挥中心与相关企业合作，共同推出国内首个高速收费计算器——“ETC对账助手”/从5月6日高速正式恢复收费起，用户可进入高德地图app找到“ETC对账助手”功能，在行前即可预估全程收费金额，通过高速时可及时查看本段高速的预估金额，行程结束后还可以查询全程多段高速的预估收费账单，自动计算全程预估费用，让过路费有本明白账'
        }, {
          'count': 13,
          'keywords': '美国/结婚/研究/国家/报告/病毒/指出/新冠/实验室/人员',
          'keysentences': '据俄罗斯卫星通讯社29日报道，当天，美国CDC下属的国家卫生统计中心发布了一项研究报告，报告表明，在国家卫生统计中心掌握最新完整数据的2018年，每1000名美国成年人仅有6.5对夫妇成婚/报告在回顾1900年至2018年人口数据的基础上指出，随着1945年二战结束，数百万美国士兵重返家乡，这使得美国结婚率在1946年达到每1000人中有16.4对夫妇的峰值，此后美国的结婚率呈平缓下降趋势/当地时间29日，美国疾控中心（CDC）下属国家卫生统计中心发布研究报告指出，美国结婚率已降至120年来的最低水平'
        }, {
          'count': 11,
          'keywords': '特朗普/中国银行/文件/politico/报道/债务/声明/大道/交易/澄清',
          'keysentences': 'Politico 24日报道：特朗普欠中国银行巨额债务“Politico”在24日题为《特朗普欠中国银行数千万美元》的报道中称，特朗普拥有“美洲大道1290号“30%的股份，而该建筑在2012年进行了约9.5亿美元再融资，其中包括来自中国银行的2.11亿美元贷款/“Politico”并未立即澄清相关报道，因为他们认为这份声明与贷款服务机构的文件相悖：富国银行（Wells Fargo）2017年的一份文件称，中国银行拥有“美洲大道1290号”大楼的金融权益/在该报道发布第二天，“Politico”收到了中国银行美国分行一位代表的声明，称该行在2012年交易之后不久就出售了相关债务，或将其证券化'
        }, {
          'count': 11,
          'keywords': '留学生/学习/日语/黄鸿伟/日本/咨询/中国/打工/工作人员/外国',
          'keysentences': '资料图(路透社)据报道，对于中国留学生黄鸿伟来说，外出打工不仅是其收入来源，也是他学习日语的实践机会/据黄鸿伟透露，最近留学生都在宿舍里上着日语在线课，但总觉得不够，“毕竟留学时间只有一年，如果只是在宿舍学习的话，和在中国学习没什么区别”/除了损失每月10万日元的打工收入外，黄鸿伟还失去了学习实践日语的机会'
        }, {
          'count': 11,
          'keywords': '集团/开域/案件/经理/去年/公司/贿赂/人士/调查/上海',
          'keysentences': '网易科技讯 4月30日消息，据外媒报道，据两位知情人士透露，中国电商巨头拼多多已经向上海警方报案，原因是其一名员工涉嫌接受数字营销公司开域集团(Cue Holdings)经理的贿赂/知情人士表示，拼多多怀疑开域集团一名销售经理去年向拼多多的一位经理行贿，以便赢得近40亿元人民币广告预算项目/在逮捕消息传出之前，开域集团在一封电子邮件中说：“确实有关于拼多多工作人员涉嫌受贿的案件正在调查中，这起案件还涉及开域集团一名已经离职的前员工'
        }, {
          'count': 10,
          'keywords': '遗体/殡仪馆/存放/居民/卫生部/搬运/cbs/丧葬/纽约/布鲁克林',
          'keysentences': '据美国广播公司（ABC）29日报道，纽约布鲁克林区一家殡仪馆外的两辆非冷藏式卡车内存有100具遗体，周围居民抱怨车内飘出恶臭味/纽约州卫生部在一份声明中表示，已经获悉殡仪馆存放遗体的空间不足，正在作出其他安排/4月12日，嫂子及11岁侄儿、8岁侄女的遗体被从30公里外的沙漠中挖出，疑似被焚尸杀害'
        }, {
          'count': 9,
          'keywords': '措施/延长/疫情/病毒/管控/报道/期限/纽约州/安全检查/合作',
          'keysentences': '据俄罗斯卫星通讯社早前报道，俄罗斯总理米舒斯京29日在俄抗击新冠病毒协调委员会会议上宣布，俄政府决定延长针对外国人入境限制措施的期限/纽约州州长科莫表示，全州范围的管控措施5月15日到期，将延长州内许多地区管控措施的有效期/他表示，俄政府先前针对外国人入境的限制措施至4月30日到期'
        }, {
          'count': 9,
          'keywords': '病例/疫情/确诊/上海市/上海/中国/抗疫/张文宏/暴发/国家',
          'keysentences': '30日，国家卫健委新闻发言人米锋表示，4月29日境外输入现有确诊病例为35天来最低，#境外输入病例已有近2/3患者治愈#出院，但境外疫情暴发、增长态势仍在持续，国内防止疫情反弹的复杂性也在增加/之后疾控部门发挥了持之以恒的调查精神，先后调查了大概160多个相关人员，最终通过将近7天努力，发现这个病例曾经和另外一个本市确诊病例在游泳池里有过交集，而这个确诊病例自身又跟另外一个上海的聚集性疫情当中的另外一例病例有关系，而这个聚集性疫情病例又跟外省市的一起聚集性疫情有关系，这就凸显了流调工作要持之以恒的重要性/上海市疾控中心副主任孙晓冬：曾经发现一起聚集性疫情，一男一女两个病例，女的确诊病例是由这个男性作为传染源，但是这个男的我们一直没有追溯到他的感染来源在哪里'
        }, {
          'count': 9,
          'keywords': '男人/买单/关系/网站/禁闭/约会/已婚/婚外情/分担/发生',
          'keysentences': '她以前使用的是其他约会平台，但总是遇到希望她买单或分担账单的男人，所以为了找到一个愿意宠她的男人，她换到了这个婚外情网站/” “许多男人并不太在乎禁闭令，他们本来想马上发生关系，但我让他们等一等，还是要遵守防疫规定/江苏南京旅游市场推出新“菜单” 自从丽贝卡在某婚外情网站使用新头像后，就不断受到了已婚男的邀约'
        }, {
          'count': 9,
          'keywords': '美国/肺炎/数据/新冠/影响/经济学家/累计/病例/确诊/预计',
          'keysentences': '据德国联邦疾控机构罗伯特·科赫研究所公布的数据，截至当地时间4月30日0时，德国累计确诊新冠肺炎病例159119例，新增确诊1478例，死亡6288例/据美国约翰斯·霍普金斯大学发布的新冠肺炎数据，截至美国东部时间4月29日晚6时，全美共报告新冠肺炎确诊1036652例，死亡60475例，共检测6026107例/另据日本广播协会（NHK）的最新统计数据，截至30日，日本累计确诊新冠肺炎病例14120例，死亡436例'
        }, {
          'count': 9,
          'keywords': '医疗/医院/护士/美国/收入/公司/工资/帕克斯/急诊科/工作',
          'keysentences': '医护人员被迫减薪据英国广播公司（BBC）29日报道，美国明尼苏达州圣保罗市的一名儿科护士玛丽亚·布克斯顿（Mariya Buxton）因收不到工资而被医院要求留在家中，她对此坦言称：“虽然护士们被称为英雄，但我现在真的不觉得自己是英雄，因为我没有尽到自己的责任/” 报道称，在布克斯顿工作的医院乃至美国大部分地区的医院，被认定为非紧急的医疗服务已经停止，这意味着医疗公司蒙受了巨大的收入损失/新冠肺炎疫情期间，虽然美国的医疗人员不仅面临人手短缺的困境，而且还要在感染病毒的风险下工作，但是由于医疗公司削减成本，全美数以万计的医护人员正被大幅削减薪水，许多护士因为拿不到工资，只能待在家中'
        }, {
          'count': 9,
          'keywords': '黎平/内蒙古/孟建伟/违规/公安厅/内蒙古自治区/发布会/新闻/公务/批准',
          'keysentences': '在解读该文件时，新闻发布会还提到了几个人：内蒙古自治区政协原副主席赵黎平内蒙古公安厅原党委委员、副厅长孟建伟通辽市公安局科尔沁区公安分局施介派出所行政工勤人员杜文杰据《环球人物》报道，赵黎平是新中国成立后首个亲手杀人（其情妇）的省部级官员/政知君注意到，赵黎平在2005年3月至2012年7月担任内蒙古公安厅厅长期间，孟建伟曾任公安厅副厅长/新中国成立后首个亲手杀人的省部级4月29日,内蒙古公安厅召开新闻发布会，发布了上述文件'
        }, {
          'count': 8,
          'keywords': '女儿/阿强/亲生/出生/亲子鉴定/鉴定/小云/出轨/结婚/男子',
          'keysentences': '小云说，结婚后，因丈夫长期在外地工作，她便长期居住在娘家，女儿出生后，也是由她照看； 小云对于阿强与女儿之间不具有亲生血缘关系的鉴定意见没有异议，亦未申请进行重新鉴定/登记结婚6个多月后女儿出生，婚后男子不停出轨，为此还向妻子写下多封保证书； 与此同时，他又对女儿出生时间存疑，一做亲子鉴定，孩子居然不是亲生的/事件前后：女儿非亲生男子起诉离婚，妻子提出他婚内出轨反索赔5年前，阿强与小云（均为化名）经人介绍认识，谈起了恋爱'
        }, {
          'count': 8,
          'keywords': '西韦/美国/新冠/研究/肺炎/重症/发布/团队/中国/试验',
          'keysentences': '” 据了解，此次中国团队进行的这项研究，是首个评估了静脉注射瑞德西韦对新冠肺炎成人重症住院患者有效性的随机、双盲、安慰剂对照临床试验/澎湃新闻记者 承天蒙中国团队针对瑞德西韦治疗新冠肺炎重症患者的临床试验报告发表，得出的结论与美国机构披露的结论差异较大/同一天，瑞德西韦的研发药企美国吉利德科学公司（Gilead Sciences, Inc.）也发布声明称，美国国家过敏和传染病研究所（NIAID）对瑞德西韦的研究，取得了积极的数据，“我们了解到，该试验已经达到了主要终点，NIAID将在即将举行的通报会上提供详细信息'
        }, {
          'count': 8,
          'keywords': '途牛/上市/盈利/股价/退市/受访/财务数据/于敦德/首席/执行官',
          'keysentences': '但在上市前夕，途牛创始人、董事长兼首席执行官于敦德曾受访时称，公司中长期实现盈利不是问题/事实上，途牛实现盈利的压力自上市之时便已存在/截至4月29日收盘，途牛报收0.88美元，连续15个交易日股价低于1美元，存在触发纳斯达克“1美元退市法则”的风险'
        }, {
          'count': 8,
          'keywords': '美国/信息/疫情/新冠/肺炎/区分/言论/受访者/消息/显示',
          'keysentences': '据美国有线电视新闻网（CNN）29日报道，美国智库皮尤研究中心最新进行的一项民调显示，约50%的美国人坦言自己“很难区分”有关疫情的真实消息和虚假言论，而49%的美国人则觉得区分有关疫情的真实信息与虚假信息“较容易”/近日，一项民调显示，近半数美国人认为，有关新冠肺炎疫情的信息“真假难辨”/CNN刊文指出，不法分子正是利用新冠病毒是一种新兴传染病的这一特点来混淆视听，这也解释了为什么新冠肺炎疫情不仅是一场公共健康危机，而且还是一次信息危机'
        }, {
          'count': 7,
          'keywords': '视频/物体/不明/飞行员/飞行/报道/质疑/消除/cnbc/早前',
          'keysentences': '其中一段视频中，飞行员称不明物体在120节的风速中“逆风飞行”，另一段视频中，飞行员切换了几次侦查成像模式，成功地捕捉到不明物体的位置，但随后该物体突然加速，越出了监视范围/据美媒CNBC早前报道，当地时间27日，美国国防部公开了三段由海军飞行员拍摄的“不明空中现象”视频/这三段视频在2007年和2017年被未授权泄露，并一直在公众之中流传'
        }, {
          'count': 7,
          'keywords': '阿强/小云/离婚/返还/抚养费/法院/过错/孩子/亲子关系/医疗费',
          'keysentences': '法院判决：两人离婚女方返还抚养费，双方均有过错索赔不予支持湖里法院审理认为，阿强与小云夫妻感情确已破裂，双方都同意离婚，应予准许/在婚姻关系存续期间，小云所生育的孩子与配偶阿强之间不存在亲子关系，小云未将实情告知阿强，并使对方承担对孩子的抚养义务，阿强请求她返还其支出的抚养费的理由成立，应予支持/这段婚姻才维持了两年多，去年阿强却到法院起诉小云，要求离婚，还要小云返还抚养费、产检等医疗费、亲子关系鉴定费以及赔偿精神损害抚慰金10万元'
        }, {
          'count': 7,
          'keywords': '小云/保证/阿强/家庭/专家/发生/备受/发展/综合性/留守',
          'keysentences': '在其中一份保证书中，阿强保证今后将以家庭为主，不做任何让小云不开心的事； 另一份则是阿强向小云保证以后不再出轨，不再做对不起家庭的事，保证不跟其他女人发生关系/他表示，上海医疗资源有很多大型综合性医院和专家，根据疫情发展态势，对援鄂和留守本地专家都做了周密安排，保证了两支队伍高质量运行/在小云提交的证据中，有婚后一年多阿强向她出具的两份《保证书》'
        }, {
          'count': 7,
          'keywords': '印度/理事会/检测/中国/研究/公司/试剂盒/病毒/医学/试剂',
          'keysentences': '问：4月27日，印度医学研究理事会表示由于部分地方邦区反映从中国进口的新冠病毒抗体快速检测试剂盒测试出现问题，理事会对中国广州万孚和珠海丽珠两家公司生产的检测试剂盒进行了实地测试，评估结果差异很大，与公司承诺的优良表现不符，因此要求各邦停止使用这些试剂并予以退货/我们注意到，中国广州万孚生物技术股份有限公司和珠海丽珠试剂股份有限公司已就此发表声明，强调其生产的新冠病毒抗体快速检测试剂盒均已通过中国药监局审批，符合质量标准要求，也通过了印度医学研究理事会下属机构印度国家病毒研究所的验证，并被认为是满意的产品/近一段时间，驻印度使馆与印度医学研究理事会以及中方公司保持密切联系，了解核实有关情况'
        }, {
          'count': 7,
          'keywords': '故意杀人罪/犯罪/开枪/采访/中国/依法严惩/弟弟/接受/路透社/被害人',
          'keysentences': '当地时间29日，特朗普在白宫接受路透社采访时宣称，中国“将尽其所能”使他在11月的总统大选中连任失败/29日，特朗普在白宫总统办公室接受路透社采访，对中国言辞强硬，声称中国政府“将尽其所能”让他在11月的总统大选中连任失败/《人民日报》在《杀人重罪就当依法严惩重判》中曾提到：赵黎平有预谋作案，持枪追杀并在居民区开枪杀死被害人，抛尸时为泄愤又向被害人开枪射击，并用汽油焚尸灭迹，其所犯故意杀人罪犯罪性质、情节特别恶劣，犯罪手段特别残忍，罪行极其严重，社会危害极大、影响极其恶劣，且拒不认罪，应依法严惩'
        }, {
          'count': 6,
          'keywords': '组织/世卫/中国/疫情/萨克/特使/访问/采取行动/北京/提问',
          'keysentences': '随后萨克又质疑谭德赛访问北京后对中国充满溢美之词，纳巴罗打断他，严肃地说，世卫组织表扬中国，是因为中国做了正确的事，“That was praised because it was the right thing to do”/” 他宣布，根据《国际卫生条例》，世卫组织将在30日再次召开紧急委员会会议，对疫情发展进行评估，并更新建议/近日，世卫组织疫情特使纳巴罗接受BBC采访'
        }, {
          'count': 6,
          'keywords': '工作/追逃/人员/追赃/协调/反腐败/中医/高级别/定点医院/专家',
          'keysentences': '” 4月28日，在中央反腐败协调小组国际追逃追赃工作办公室统筹协调下，经过公安部以及浙江省、云南省追逃办和公安机关扎实工作，“红通人员”胡亦品在越南落网并被遣返回中国/再次正告所有外逃人员，全面从严治党和反腐败斗争永远在路上，疫情不会阻挡追逃追赃工作步伐，回国投案才是唯一正确出路/” 感染、呼吸、重症、心脏、中医等上海最优秀的专业团队14名专家组成的高级别专家组，驻在定点医院从不离开'
        }, {
          'count': 6,
          'keywords': '娄某/梁某平/舅舅/结婚/婚姻法/遗产/母亲/法院/申请/照顾',
          'keysentences': '要说起人生中最重要的事情很多人都会选择它“结婚”在大家心中“结婚”是一件非常神圣的事情可有人为了一己私利竟然干出这种事↓↓↓2019年贵州贵阳的女子娄某因为舅舅梁某平被诊断出肝癌晚期她自愿来照顾舅舅并且和他一起生活有一天娄某突然想到一个问题“舅舅的财产面临无人继承”为了能拿到遗产娄某也想出了令人咋舌的一招2019年9月29日她竟然和舅舅梁某平登记结婚今年4月9日娄某的舅舅梁某平因病死亡可当她以为遗产到手时结果/娄某的母亲把她告上法院根据《婚姻法》第七条规定直系血亲和三代以内的旁系血亲禁止结婚梁某平是女子娄某的亲舅舅二人的婚姻显然无效4月20日在收到娄某母亲的申请后当地法院不公开开庭进行了审理4月24日法院对该案进行宣判判处娄某和梁某平的婚姻无效/2019年9月，梁某平检查出肝癌晚期，由于没有直系亲属照顾，娄某就自愿来照顾舅舅梁某平，并与梁某平一起生活'
        }, {
          'count': 6,
          'keywords': '发生/受害人/民勤县/致命/新闻/荔枝/母子/政府网/疑因/夜晚',
          'keysentences': '受害人亲属朱先生告诉荔枝新闻，4月6日早上，其外出做生意回家的哥哥发现家中妻儿三人不见踪影，地上有血迹和牙齿/荔枝新闻注意到，民勤政府网4月24日通报，2020年4月5日，民勤县发生一起刑事案件，3人遇害/民勤政府网官网截图致命夜晚：同村凶手提前“踩点” 疑因受害人参与其家事朱家人至今不愿相信一家三人殒命的消息'
        }, {
          'count': 6,
          'keywords': '案件/公司/合规/公安机关/kkr/密切合作/品案/建立/组合/影响',
          'keysentences': 'KKR表示，已经知道这些指控，但鉴于案件正在调查中，不宜进一步置评/中央追逃办将胡亦品案列为重点督办案件，中越两国公安机关克服疫情影响、开展密切合作，在较短时间内将胡亦品缉捕并遣返/该公司表示，不会宽恕任何违反合规要求的行为，也没有立即回复进一步置评的请求'
        }, {
          'count': 6,
          'keywords': '嫂子/哥哥/床上/父母/还给/牙齿/脱落/被褥/不见/茶几',
          'keysentences': '“当天晚上8点钟，嫂子还给住在附近的父母送了东西； 当天晚上10点多，在70多公里外做生意的哥哥还和嫂子通过微信进行了联系”/回到家中，朱先生哥哥看到了令他惊诧的一幕，地上和茶几上均有血迹，床上还有脱落的牙齿，床上的被褥也不见了，妻儿三人均不在家/哥哥又问了父母，都不知道嫂子和孩子们去了哪里'
        }, {
          'count': 6,
          'keywords': '美国/经济/疫情/封锁/复苏/新冠/全美/蔓延/投资/预测',
          'keysentences': '当下，全美多位律师纷纷预测称，美国一旦解除为遏制疫情而实施的封锁措施，该国离婚率将创历史新高，新冠肺炎疫情危机给全美数百万家庭带来了前所未有的冲击/与此同时，全美多位律师预测称，一旦美国解除为遏制疫情而实施的封锁，美国的离婚率也恐创历史新高/部分因贸易战而陷入困境的商业投资连续第四个季度下滑； 新冠病毒在美国蔓延初期，许多经济学家预计会出现“V型”复苏，经济急剧下滑后会迅速地反弹'
        }, {
          'count': 6,
          'keywords': '珠峰/高程/测量/尼泊尔/中尼/联合声明/友谊/周年/建交/中国',
          'keysentences': '此次珠峰高程测量正值中国和尼泊尔建交65周年之际，自1955年建交以来，无论国际形势如何变化，中尼关系始终持续、稳定、健康发展/今年也是人类首次从北坡成功登顶珠峰60周年、中国首次精确测定并公布珠峰高程45周年，开展此次珠峰高程测量具有重要的历史意义/习近平主席于2019年10月12日至13日对尼泊尔进行国事访问期间，两国发布了《中华人民共和国和尼泊尔联合声明》，其中提出：考虑到珠穆朗玛峰是中尼两国友谊的永恒象征，双方愿推进气候变化、生态环境保护等方面合作'
        }, {
          'count': 6,
          'keywords': '病毒/中国/新冠/传播/野生动物/人类/politico/事故/人员/动物',
          'keysentences': '4月24日，美国政治新闻网站“Politico”公布了一份备忘录，长达57页的文中详细建议了共和党候选人应该通过积极攻击中国，来应对本地的新冠疫情：包括污蔑中国“掩盖”病毒导致疫情爆发，民主党人“对中国太温和”，以及共和党人将“推动制裁中国的计划，理由是后者涉及传播病毒”/实验室事故导致产生新冠病毒几乎不可能关于被正式称为SARS-CoV-2的新冠病毒究竟如何开始在人类中传播，仍然有很多谜题未能解开/相反，接受NPR采访的专家都认为，该病毒是在自然界的动物和人类之间传播的，就像以前暴发的已知流行性病毒一样，比如非洲埃博拉病毒，还有非典SARS以及MERS等'
        }, {
          'count': 5,
          'keywords': '海南大学/王小妮/发生/校方/事件/新闻记者/诗学/研究/传播学院/证实',
          'keysentences': '东方网·纵相新闻记者就此事电话联系了海南大学党委宣传部，对方表示，事件发生后第一时间校方就已留意，并已与海南省教育行政部门进行了沟通/校方人员同时向东方网·纵相新闻记者证实，王小妮确系海南大学退休职工，2012年从海南大学退休/截至发稿前，海南大学暂未有针对此事的正式声明'
        }, {
          'count': 5,
          'keywords': '孩子/口罩/爷爷/费用/操场/带到/寒假/呼吸/单位/治疗',
          'keysentences': '考虑到孩子们每天带着口罩非常难受，学校以年级为单位错时，每天上午和下午固定一节课将孩子们带到花园、操场摘下口罩自由呼吸/受疫情影响这个寒假特别长孩子安全问题家长们千万要当心/除了自己，孩子的爷爷也在医院陪伴，且治疗费用由孩子的爷爷支付，目前已经花费四五万元'
        }, {
          'count': 5,
          'keywords': '合作/学科/上海/法律手段/强有力/循证/负隅顽抗/执法/医学/外逃',
          'keysentences': '这次一开始大家就意识到这是一场非常复杂的战役，如果不采取多学科的精锐部队一起紧密合作，可能不能取得让最为满意的结果，所以上海一开始就采取了集中收治的做法/“上海遵循的模式就是多学科合作，遵循循证医学的原则，不断地创新/完整的多学科合作，是这次上海医疗队抗“疫”亮点之一'
        }, {
          'count': 5,
          'keywords': '减少/服务业/全球/关门/餐馆/打击/花费/推迟/航班/支出',
          'keysentences': '第一季服务业支出下降10.2%，餐厅和酒店支出较上年同期减少近30%/这场全球大流行对美国服务业打击尤其严重，餐馆关门、航班停运、体育馆闲置/疫情导致全球贸易几乎中断，进出口额均大幅减少'
        }, {
          'count': 5,
          'keywords': '歹徒/警方/袭击/老伴/倡议/持枪/发起/民众/去世/通电话',
          'keysentences': '柯克还认为，这是一起有预谋的袭击，疫情期间人们鲜少上街走动，歹徒选中戴维只是因为他恰好出现在街上，歹徒残忍地向他连捅数刀/根据初步调查和分析，警方表示，这伙歹徒的袭击动机尚不明确/由于目前仍缺乏与这伙歹徒相关的线索和证据，警方也向附近民众发起倡议，希望能找到目击证人'
        }, {
          'count': 5,
          'keywords': '胡亦品/追逃/贷款/外逃/分行/身为/高新区/党员/支行/彰显',
          'keysentences': '胡亦品，男，1986年12月出生，中共党员，交通银行温州分行高新区支行原主管，涉嫌贷款诈骗罪/今年3月12日，胡亦品外逃越南，同日温州市公安局对其立案侦查/胡亦品在疫情期间被缉捕归案，充分彰显了党中央有逃必追、一追到底的坚定决心，是“天网2020”行动和金融领域追逃追赃重要成果'
        }, {
          'count': 5,
          'keywords': '收入/旅游/途牛/增长/小额/办理/人民币/冲击/资金/行业',
          'keysentences': '2019年，受益于跟团游收入的增长，其打包旅游产品收入为19亿元，同比上升3.1%； 而在今年，新冠肺炎疫情对旅游行业造成的冲击，让途牛再度陷入困难的境地/财务数据显示，途牛去年实现营业收入22.81亿元（人民币，下同），同比增长1.82%/此外，日本各地政府的社会福利机构也可办理“紧急小额资金”项目，如果通过审查，最多可以无息贷款20万日元（约合人民币13240元）'
        }, {
          'count': 5,
          'keywords': '丽贝卡/妻子/客户/工作/提供/约会/外遇/专业/情人/视频',
          'keysentences': '据丽贝卡透露，有两位“情人”向她公开过自己的婚姻状况，他们的妻子也有外遇，其中一位妻子甚至在他们进行视频关系时也加入进来/丽贝卡和已婚男约会，却一点儿也不觉得内疚，因为她并没有想过要拆散别人的婚姻/报道称，丽贝卡的工作是为客户提供专业的私人护理'
        }, {
          'count': 5,
          'keywords': '公司/亏损/下降/知名/途牛/ota/业务收入/收入/影响/企业',
          'keysentences': '对此，该公司预计一季度净收入约1.14亿元至1.60亿元，同比下降65%至75%/但在金融和保险服务收入下降的影响下，该公司其他业务收入为3.94亿元，同比下降3.7%/若以一个完整的财年度为参照，途牛花了6年时间仍然没有摆脱亏损境地'
        }, {
          'count': 5,
          'keywords': '标准/通行费/收费/车辆/应交/货车/小于/路者/付费/高速公路',
          'keysentences': '吴德金指出，据统计，通过新一轮收费标准调整，各地高速公路货车通行费收费标准进一步下调，在高速公路通行的辆次中，平均75.3%辆次的通行费额下降，其中二类至六类货车平均受益频次分别为65.6%、64.6%、66.7%、71.4%和82.4%，包括了大部分快递、危险化学品运输车辆/三是新标准反算吨位应小于2018年和2019年高速公路货车加权平均总质量，且至少60%以上频次车辆受益，也就是实际交通量中，至少60%以上车次的通行费小于计重收费时的应交费额/此外，取消省界收费站后，车长6米以下的8座和9座小型客车，统一由二类下调为一类，应交通行费有较大幅度下降'
        }, {
          'count': 4,
          'keywords': '结婚/消息/美国/毕业/吉林大学/中文系/执行/死刑/华盛顿邮报/下降',
          'keysentences': '另据《华盛顿邮报》消息，2018年美国结婚率较2017年下降了6％/2017年5月被执行死刑/1982年毕业于吉林大学中文系'
        }, {
          'count': 4,
          'keywords': '治疗/疫情/肺炎/新冠/循证/医学/科学/证据/夸大/消毒剂',
          'keysentences': '特朗普在白宫疫情简报会中发表的有关疫情的言论，其中不少要么是错误的，要么有夸大事实的嫌疑，如“注射消毒剂可能可以治疗新冠肺炎”，“羟氯喹可有效治疗新冠肺炎”， “美国已经成功控制住了新冠疫情”等/” 张文宏说，多学科专家在一起，只有基于循证医学证据的科学讨论才能把有效的临床治疗推行下去并且取得最好的结果/凡凡在哈尔滨市儿童医院接受治疗'
        }, {
          'count': 4,
          'keywords': '博物馆/预约/公众/开放/全国/模式/假期/项线/活动/好转',
          'keysentences': '北京地区博物馆5月1日起有序开放5月1日开始，北京地区183家博物馆将陆续开放，公众可登陆各博物馆官网预约参观/今年的五一假期有5天，随着疫情防控形势的好转，全国多地景区也陆续恢复开放/北京地区博物馆还将推出41项线上活动，包括云展览、直播、科普视频等，公众可以足不出户享受博物馆“云体验”'
        }, {
          'count': 4,
          'keywords': '商铺/卷闸门/卢先生/停放/贵港市/交通肇事/逃逸案/损坏/擦碰/做生意',
          'keysentences': '卢先生介绍，4月24日上午，他照常开铺做生意时发现，前一晚停放在商铺门口的小型货车直线移动一米多，将车后商铺卷闸门撞凹一部分/4月30日，记者从贵港市公安局交警支队三大队获悉一宗离奇交通肇事逃逸案：贵港市民卢先生发现自己前晚停放在自家商铺前的爱车位置移动过，且车身和商铺卷闸门都有擦碰损坏痕迹，他怀疑是交通肇事逃逸案/1时27分许，车辆突然启动撞向商铺卷闸门，其引擎盖部位冒出白烟'
        }, {
          'count': 4,
          'keywords': '民警/枪支/事故/发现/中队/展开/异状/出警/社区/杀人',
          'keysentences': '贵港市公安局交警支队三大队事故处理中队民警立即出警展开调查，他们发现，除去小型货车发动机舱内的电池有几处水渍外，其他并无异状，现场也没有任何其他车辆留下的痕迹/这里的一个背景是，十八大后，内蒙古一些公安机关领导干部、民警非法持有枪支，甚至有人持枪杀人，典型的就是赵黎平/两位副所长和负责收缴这把枪支的社区民警一起商量解决办法'
        }, {
          'count': 4,
          'keywords': '医院/担心/护士/新冠/不想/时间/措施/服务/医疗/常规',
          'keysentences': '” 她表示，虽然自己支持为遏制新冠病毒传播而采取的措施，但她担心医院无法提供常规医疗服务的时间越长，就会有越多的护士陷入和她一样的处境/她说，“我听到几乎每一个病人都说他们真的不想去医院，因为他们害怕感染新冠病毒/“人们总是对我说，当一名护士你永远不用担心失业'
        }, {
          'count': 4,
          'keywords': '经济/美国/报道/疫情/风险/发布/预测/显示/连任/面临',
          'keysentences': '《纽约时报》分析称，此次美国经济受损范围较大：作为十年经济扩张基础的消费支出以7.6%的速度下降； 4月30日，21世纪经济报道记者向途牛核实/路透社报道截图据路透社报道，新冠疫情已导致美国至少6万人死亡，并使美国经济陷入深度衰退，面临连任风险的特朗普则选择指责中国/美国国会预算办公室上周发布预测显示，虽然美国经济将在今年下半年重新开始增长，但GDP最早要到2022年才能恢复到疫情前水平'
        }, {
          'count': 4,
          'keywords': '客户端/分戴/版本/戴维戈/伦敦/纽汉区/时间/安卓/iphone/体验',
          'keysentences': '使用安卓和iPhone最新版本客户端可获得更流畅体验，下载地址： 安卓用户点这里 iPhone用户点这里 图源：地铁报24岁戴维·戈莫住在伦敦东部的纽汉区，当地时间26日晚10点30分左右，戴维在离家几秒钟后被杀害'
        }, {
          'count': 4,
          'keywords': '收费公路/标准/收费/公路/期限/车辆通行/主管部门/批准/有偿/交通运输',
          'keysentences': '4月30日，在交通运输部4月份例行新闻发布会上，交通运输部公路局局长吴德金介绍，根据《收费公路管理条例》的规定，车辆通行费的收费标准，应当根据公路的技术等级、投资总额、当地物价指数、偿还贷款或者有偿集资款的期限和收回投资的期限以及交通量等因素计算确定/经国务院同意，从2020年5月6日零时起，经依法批准的收费公路恢复收取车辆通行费/其中，政府还贷公路的收费标准，由省级交通主管部门会同同级价格主管部门、财政部门审核后，报省级人民政府审查批准； 经营性公路的收费标准，由省级交通主管部门会同同级价格主管部门审核后，报省级人民政府审查批准'
        }, {
          'count': 4,
          'keywords': '新冠/中国/方式/特朗普/病毒/纽约/美国/疫情/扬言/事情',
          'keysentences': '就在美国27日确诊病例破百万当天，特朗普在记者会中宣称，他认为中国“本可以阻止”新冠病毒，甚至扬言美国将会“严肃调查”这场病毒危机/研究大流行病起源的组织纽约生态健康联盟主席彼得·达萨克（Peter Daszak）说：“真正的风险在于人类与自然中野生生物接触的方式，如果我们想为防止下一波大流行做些真正的事情，那才是我们需要重点关注的方向/值得注意的是，特朗普并未透露相关依据，只是表示中国在新冠疫情间的行事证明了这一点'
        }, {
          'count': 4,
          'keywords': '孩子/化名/母亲/记者/昏迷/处于/状态/建三江/京报/通报',
          'keysentences': '黑龙江省建三江垦区4岁女童凡凡（化名）被“继母”虐打一事持续引发关注，今日（4月30日）中午，新京报记者从凡凡母亲处了解到，孩子仍处于昏迷状态，后续情况仍是未知数/截图凡凡母亲张婷（化名）说，凡凡仍处于昏迷状态，尚未清醒，在ICU病房继续治疗/张婷告诉新京报记者，因孩子住在ICU病房，花费较大，治疗费用有些紧张，“但不论如何也不会放弃救孩子'
        }, {
          'count': 4,
          'keywords': '戴维/家人/父亲/沉浸/新冠/肺炎/去世/母亲/全家/妹妹',
          'keysentences': '短短数日内，戴维的母亲和妹妹就失去了两位最亲密的家人，他们悲痛欲绝/戴维的父亲不久之前因新冠肺炎去世后，全家一直沉浸在悲恸之中，父亲的葬礼原定于29日举行/” 据悉，戴维的母亲也是NHS的一名护士'
        }, {
          'count': 3,
          'keywords': '王小妮/言论/网友/退休/发布/海南大学/专项/工作组/成立/相关',
          'keysentences': '海南大学官方微博4月30日发布声名，针对网友反映我校退休教师王小妮个人微博发布不当言论的问题，学校已成立专项工作组对相关情况进行核查/另据纵向新闻报道：4月29日，有网友爆料称海南大学退休教授王小妮曾于2011年至2014年期间在其个人微博上多次发表不当言论，引发热议/王小妮个人简介：吉林长春人'
        }, {
          'count': 3,
          'keywords': '补充/报告/采取措施/警方/纠正/富国银行/腐败/公司/功能/文件',
          'keysentences': '她补充说，该公司今年已向警方报告了18起与腐败相关的案件/中国银行补充称，富国银行正在采取措施纠正文件中的错误/线上和线下功能相互补充，可以更好地服务车主'
        }, { 'count': 3, 'keywords': '作者/裴剑飞/陈沁涵/张静姝', 'keysentences': '作者：裴剑飞 作者：陈沁涵 作者：张静姝' }, {
          'count': 3,
          'keywords': '路段/交警/留意到/碾压/韦某/幼童/事发/痛心/当日/儿童',
          'keysentences': '近日在东莞麻涌镇就发生了让人痛心一幕一个不注意2岁女童当即被碾压事发麻涌鸥涌村商业街路段，当日麻涌交警接到报警称：有名幼童被汽车碾压，受伤十分严重/交警现场问询涉事司机韦某时，对方也受到了不小惊吓，称事发当时丝毫未有留意到有名幼童在车前经过/韦某表示，当时他驾驶小车低速途经事发路段，留意到左前方有两名儿童在马路上嬉戏，还不约而同摔倒了'
        }, {
          'count': 3,
          'keywords': '妇女/车子/孩子/韦某/开车/打算/大人/意识/启动/抖动',
          'keysentences': '（一名妇女迅速奔向摔倒孩子）韦某称：“见有大人来看了，我就打算开车走了，可刚启动就意识到车子发出嘣的巨响/可他准备打开车门时，便见到一名妇女在车前快速经过，并迅速来到倆孩子面前查看/” 伴随着响声是车子剧烈的抖动，他耳边当场传来这名妇女的惊慌哭喊'
        }, {
          'count': 3,
          'keywords': '检测/试剂/拉美地区/操作/亚洲/欧洲/储存/导致/运输/规范',
          'keysentences': '我们还了解到，新冠抗体检测试剂的储存、运输和使用均有严格要求，任何未经专业人员按照产品说明规范进行的操作，都会导致检测准确率的偏差/上述公司生产的检测试剂向欧洲、亚洲、拉美等地区多个国家出口并获得了积极评价/原因还是因为评价终点不一样'
        }, {
          'count': 3,
          'keywords': '国家/数量/预定/样本量/情况/无症状/下葬/希望/公道/日本',
          'keysentences': '涉谷健司还表示，日本病毒检测数量本身相较其他国家也少，而且无症状感染者也未进行专门统计，因此不能简单与别国比较/他们三人至今未下葬，希望能有一个公道”/研究在未达到预定的样本量的情况下终止'
        }, {
          'count': 3,
          'keywords': '回应/定位/公司/运营/造谣/网易/科技/记者/途牛/数字',
          'keysentences': '途牛回应称，公司目前运营正常，已经定位到造谣者，正在做对外发文的准备/随后拼多多向网易科技记者回应称，“40亿元数字不属实/你对此有何回应'
        }, {
          'count': 3,
          'keywords': '生前/报告/显示/桐梓县/异地/居住/搬迁户/平系/男性/女性',
          'keysentences': '此外，该报告表明：“婚姻已被证实与健康和长寿相关，最新报告显示，成婚男性和女性的死亡率均低于未婚者/法院通报详情：梁某平系精准扶贫异地搬迁户，生前居住在桐梓县燎原镇蟠龙社区/尸检报告显示，马某系生前被他人用绳索捆绑后烧死'
        }, {
          'count': 3,
          'keywords': '死亡/人数/颈动脉/物体/日本/作用/钝性/颈部/生前/失血',
          'keysentences': '朱某昱系生前被他人用钝性物体作用颈部致右侧颈动脉破裂、左侧颈动脉断裂造成大失血死亡，死后焚尸/朱某涵系生前被他人用钝性物体作用颈部致双侧颈动脉、颈静脉断裂造成大失血死亡，死后焚尸/据报道，当前，日本的确诊病例和死亡人数均低于其他发达国家，对此，涉谷健司在接受采访时称，“不能单纯比较死亡人数和死亡率等数字，因为各国的感染阶段和医疗制度情况都不相同，预计日本今后重症患者和死亡人数还会增加”'
        }, {
          'count': 3,
          'keywords': '肇事/查看/逃逸/视频/发现/监控/调取/商铺/缺德/司机',
          'keysentences': '” 民警随后调取商铺门口的视频监控，经仔细查看，终于发现三个“肇事逃逸者”的踪影/“一定是哪个缺德司机肇事逃逸了/点击继续查看'
        }, {
          'count': 3,
          'keywords': '车底/钻进/车辆/显示/受惊/飞速/紧追/下着雨/小型货车/凌晨',
          'keysentences': '据监控画面显示，4月24日凌晨1时25分许，下着雨，一只猫从远处飞快钻进小型货车车底，随后两只狗紧追而来，围着车辆不停打转/两只狗不时趴在车头，不时钻进车底，企图将猫赶离车辆/狗和猫受惊，先后飞速钻出车身逃离现场'
        }, {
          'count': 3,
          'keywords': '影响/美国/经济衰退/业务/程度/复苏/估计/新冠/当日/疫情',
          'keysentences': '经历了庞大的“退改”潮后，途牛称，“目前市场环境不稳定，我们无法合理估计新冠疫情对途牛业务造成的影响程度，但我们预计这将会对我们2020年的业务运营、财务状况、经营业绩和现金流产生重大不利影响/美联储主席鲍威尔当日称，美国经济衰退的程度和持续时间非常不确定，如果要实现强劲复苏，美国经济需要所有人提供更多支持/美联储在29日承诺将动用所有手段来减轻经济衰退的影响'
        }, {
          'count': 3,
          'keywords': '模型/重力/地壳运动/建立/提供/数据/测量/成果/研究/资料',
          'keysentences': 'GNSS测量、水准测量、重力测量的成果结合以前相关资料，不仅可以准确地分析目前地壳运动变化影响情况，同时也可为后续的似大地水准面模型建立提供准确的重力异常数据/重力测量成果可用于珠峰地区区域地球重力场模型的建立和冰川变化、地震、地壳运动等问题的研究/精确的峰顶雪深、气象和风速等数据，将为冰川监测、生态环境保护等方面的研究提供第一手资料'
        }, {
          'count': 3,
          'keywords': '英国/毕业/就职/深褐色/形象/彻底改变/国家/年轻人/头发/rebeccayoung',
          'keysentences': '据英国《每日星报》4月28日报道，最近英国谢菲尔德36岁女护士丽贝卡·杨(Rebecca Young)彻底改变了自己的形象，她把深褐色头发染成了金色，涂上了明亮的红色口红/柯克表示，戴维是一个积极进取的年轻人，他毕业后就职于英国国家医疗服务体系（NHS）/4月28日，广东广州'
        }, {
          'count': 3,
          'keywords': '平台/途牛/包括/清算/截图/内容/破产/往来款项/聊天/关联',
          'keysentences': '网传微信截图据该截图内容显示，“因途牛破产清算，请各负责人清查统计与途牛有关联的往来款项，包括应收款、应付款、预付款、各类保证金等，今日17点前把统计数据发送给我，收到请回复/” 特别声明：以上内容(如有图片或视频亦包括在内)为自媒体平台“网易号”用户上传并发布，本平台仅提供信息存储服务/近日，一则关于途牛破产清算的聊天截图在社交平台传开'
        }, {
          'count': 3,
          'keywords': '信息/特雷斯/疫情/新冠/联合国/世界/发布/此前/肺炎/抗击',
          'keysentences': '此前，联合国秘书长安东尼奥·古特雷斯（Antonio Guterres）曾在4月14日发布一则视频讲话，讲话中，古特雷斯警告称，当世界与人类公敌——新冠病毒做斗争时，需要各种有效信息作支撑，而一场“危险的错误信息疫情（misinfo-demic）”俨然“已在全球范围内”蔓延开来/据联合国新闻网站和美联社（AP）此前报道，古特雷斯认为虚假信息是“毒死人的毒药”，因此宣布联合国将发起一项运动，在互联网上发布事实和科学的信息，以此使有害信息无处遁形/古特雷斯说道，“世界必须联合起来抗击新冠肺炎疫情，并为此开具‘信任疫苗’'
        }
      ]
    }
  },
  mounted() {
    this.queryData()
  },
  methods: {
    queryData() {
      let keywords = []
      let count = []
      let keysentences = []
      for (let i = 0; i < (this.list.length < 20 ? this.list.length : 20); i++) {
        keywords.push(this.list[i].keywords)
        count.push(this.list[i].count)
        keysentences.push(this.list[i].keysentences)
      }
      this.showBar(keywords, count, keysentences)
    },
    showBar(keywords, count, keysentences) {
      let myChart = this.$echarts.init(document.getElementById('myChart'))
      let format = (e) => {
        return e.substr(0, 20) + '...';
      }
      myChart.setOption({
        title: { text: '热点舆情' },
        legend: {
          data: ['相关新闻数']
        },
        grid:{//直角坐标系内绘图网格
          show: false,//是否显示直角坐标系网格
          left: '20%',
          borderColor:"#c45455",//网格的边框颜色
        },
        tooltip: {
          formatter: function(params, callback) {
            return params.name +'<br/>' + '相关新闻数： ' + params.value
          }
        },
        xAxis: {
          type: 'value'
        },
        yAxis: {
          type: 'category',
          data: keywords,
          axisLabel: {
            interval: 0,
            formatter: format,
            color: '#333'
          },
          inverse: true
        },
        series: [
          {
            name: '热点舆情',
            type: 'bar',
            data: count
          }
        ]
      })
    }
  }
}
</script>

<style scoped>
#myChart {
  width: 100%;
  height: 860px;
}
</style>
